In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [2]:
# Age table 1
employed_vs_unemployed_by_age_file = "employed_vs_unemployed_by_age.csv"
employed_vs_unemployed_by_age_df = pd.read_csv(employed_vs_unemployed_by_age_file)
employed_vs_unemployed_by_age_df

,age_range,unemployed_males,unemployed_females,unemployed_persons,employed_males,employed_females,employed_persons
0,15–24,159565.385400,121044.090930,280609.476330,380401.489730,385679.058810,766080.548540
1,25–34,74594.166479,66539.343886,141133.510360,367450.979320,351866.668720,719317.648040
2,35–44,51645.723769,50073.315809,101719.039580,241445.846350,210000.567680,451446.414030
3,45–54,44478.867093,47368.896916,91847.764009,142725.985420,137576.324370,280302.309780
4,55–64,43499.936666,35048.634453,78548.571119,87621.948345,80653.175223,168275.123570
5,65 and over,7122.601481,4602.790347,11725.391828,12799.821098,10091.272147,22891.093245

In [3]:
# Age table 2
discouragedjobseekers_age_file = "discouragedjobseekers_age.csv"
discouragedjobseekers_age_df = pd.read_csv(discouragedjobseekers_age_file)
discouragedjobseekers_age_df

     age_range  discouraged_jobseekers
0        15–24            19127.603453
1        25–34            10210.574674
2        35–44            12010.948635
3        45–54             8337.623604
4        55–64            19210.640148
5  65 and over            34798.844168

In [4]:
# Age table 3
main_diff_by_age_range_file = "main_diff_by_age_range.csv"
main_diff_by_age_range_clean = pd.read_csv(main_diff_by_age_range_file)
main_diff_by_age_range_clean

     age_range  too_many_applicants
0        15–24             46734.44
1        25–34             62200.00
2        35–44             21908.10
3        45–54             13232.70
4  55 and over              9518.45

In [8]:
# Location table 1
employed_vs_unemployed_by_state_file = "employed_vs_unemployed_by_state.csv"
employed_vs_unemployed_by_state_df = pd.read_csv(employed_vs_unemployed_by_state_file)
employed_vs_unemployed_by_state_df

,state_territory,unemployed_males,unemployed_females,unemployed_persons,employed_males,employed_females,employed_persons
0,New South Wales,112945.715480,89785.571823,202731.287300,365633.559710,377107.826650,742741.386360
1,Victoria,94190.597794,91945.809923,186136.407720,353388.099120,326054.618320,679442.717440
2,Queensland,87235.314785,68519.251480,155754.566260,241420.677580,216821.677920,458242.355490
3,South Australia,29764.662561,24717.399134,54482.061695,74780.130808,77814.793609,152594.924420
4,Western Australia,42139.740754,35491.005275,77630.746028,138513.359290,119396.194090,257909.553370
5,Tasmania,7899.504385,6748.262709,14647.767093,24364.490804,20654.131830,45018.622634
6,Northern Territory,3391.359290,3362.262633,6753.621923,11822.139860,12612.096887,24434.236747
7,Australian Capital Territory,3339.785837,4107.509366,7447.295202,22523.613090,25405.727648,47929.340738

In [9]:
# Location table 2
discouragedjobseekers_location_file = "discouragedjobseekers_location.csv"
discouragedjobseekers_location_df = pd.read_csv(discouragedjobseekers_location_file)
discouragedjobseekers_location_df

                state_territory  discouraged_jobseekers
0               New South Wales            35294.443384
1                      Victoria            29665.225257
2                    Queensland            16515.309330
3               South Australia             5064.287140
4             Western Australia            11498.128840
5                      Tasmania             3687.193909
6            Northern Territory              941.021873
7  Australian Capital Territory             1030.624947

In [10]:
# Location table 3
jobvacancies_location_file = "jobvacancies_location.csv"
jobvacancies_location_df = pd.read_csv(jobvacancies_location_file)
jobvacancies_location_df

                state_territory  job_vacancies
0               New South Wales        62200.0
1                      Victoria        45800.0
2                    Queensland        42100.0
3               South Australia        12500.0
4             Western Australia        32200.0
5                      Tasmania         3400.0
6            Northern Territory         4200.0
7  Australian Capital Territory         5600.0

### Transform Age DataFrame

In [5]:
# Trim age table 1 columns and combine bottom rows
employedunemployed_age_df = employed_vs_unemployed_by_age_df[['age_range', 'employed_persons', 'unemployed_persons']].copy()
employedunemployed_age_df.at[4,'age_range']= "55 and over"
employed_age= employedunemployed_age_df.iloc[4]['employed_persons'] + employedunemployed_age_df.iloc[5]['employed_persons']
unemployed_age= employedunemployed_age_df.iloc[4]['unemployed_persons'] + employedunemployed_age_df.iloc[5]['unemployed_persons']
employedunemployed_age_df.at[4,'employed_persons'] = employed_age
employedunemployed_age_df.at[4,'unemployed_persons'] = unemployed_age
employedunemployed_age_clean = employedunemployed_age_df[:-1].copy()
employedunemployed_age_clean

     age_range  employed_persons  unemployed_persons
0        15–24     766080.548540       280609.476330
1        25–34     719317.648040       141133.510360
2        35–44     451446.414030       101719.039580
3        45–54     280302.309780        91847.764009
4  55 and over     191166.216815        90273.962947

In [6]:
# tage table 2 combine botttom rows
discouragedjobseekers_age_df.at[4,'age_range']= "55 and over"
discouragedjobseekers_age_df
discouraged_lastage= discouragedjobseekers_age_df.iloc[4]['discouraged_jobseekers'] + discouragedjobseekers_age_df.iloc[5]['discouraged_jobseekers']
discouragedjobseekers_age_df.at[4,'discouraged_jobseekers'] = discouraged_lastage
discouragedjobseekers_age_clean = discouragedjobseekers_age_df[:-1].copy()
discouragedjobseekers_age_clean

     age_range  discouraged_jobseekers
0        15–24            19127.603453
1        25–34            10210.574674
2        35–44            12010.948635
3        45–54             8337.623604
4  55 and over            54009.484316

In [7]:
# Merge 3 Age tables
age3 = employedunemployed_age_clean.merge(discouragedjobseekers_age_clean, on='age_range')
age4 = age3.merge(main_diff_by_age_range_clean, on='age_range')
jobseekers_challenge_by_age = age4
jobseekers_challenge_by_age

,age_range,employed_persons,unemployed_persons,discouraged_jobseekers,too_many_applicants
0,15–24,766080.548540,280609.476330,19127.603453,46734.44
1,25–34,719317.648040,141133.510360,10210.574674,62200.00
2,35–44,451446.414030,101719.039580,12010.948635,21908.10
3,45–54,280302.309780,91847.764009,8337.623604,13232.70
4,55 and over,191166.216815,90273.962947,54009.484316,9518.45

### Transform Location DataFrame

In [16]:
# Trim location table 1 columns
employed_vs_unemployed_by_state_df = employed_vs_unemployed_by_state_df[['state_territory', 'employed_persons', 'unemployed_persons']].copy()
employed_vs_unemployed_by_state_df

                state_territory  employed_persons  unemployed_persons
0               New South Wales     742741.386360       202731.287300
1                      Victoria     679442.717440       186136.407720
2                    Queensland     458242.355490       155754.566260
3               South Australia     152594.924420        54482.061695
4             Western Australia     257909.553370        77630.746028
5                      Tasmania      45018.622634        14647.767093
6            Northern Territory      24434.236747         6753.621923
7  Australian Capital Territory      47929.340738         7447.295202

In [17]:
# merge location columns
location3 = employed_vs_unemployed_by_state_df.merge(discouragedjobseekers_location_df, on='state_territory')
location4 = location3.merge(jobvacancies_location_df, on='state_territory')
location4
jobseekers_challenge_by_location = location4
jobseekers_challenge_by_location

,state_territory,employed_persons,unemployed_persons,discouraged_jobseekers,job_vacancies
0,New South Wales,742741.386360,202731.287300,35294.443384,62200.0
1,Victoria,679442.717440,186136.407720,29665.225257,45800.0
2,Queensland,458242.355490,155754.566260,16515.309330,42100.0
3,South Australia,152594.924420,54482.061695,5064.287140,12500.0
4,Western Australia,257909.553370,77630.746028,11498.128840,32200.0
5,Tasmania,45018.622634,14647.767093,3687.193909,3400.0
6,Northern Territory,24434.236747,6753.621923,941.021873,4200.0
7,Australian Capital Territory,47929.340738,7447.295202,1030.624947,5600.0

### Create database connection

In [ ]:
# connection_string = "postgres:postgres@localhost:5432/customer_db"
# engine = create_engine(f'postgresql://{connection_string}')

In [ ]:
# Confirm tables
engine.table_names()

### Load DataFrames into database

In [ ]:
premise_transformed.to_sql(name='premise', con=engine, if_exists='append', index=True)

In [ ]:
county_transformed.to_sql(name='county', con=engine, if_exists='append', index=True)